Masmiseim36/nxpSDK/boards/lpcxpresso55s69/demo_apps/mc_pmsm/pmsm_snsless/cm33_core0/pin_mux.c
    if (Chip_GetVersion()==1)
    {
        IOCON->PIO[0][18] = ((IOCON->PIO[0][18] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_INVERT_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT018 (pin 56) is configured as SCT0_OUT1. */
                         | IOCON_PIO_FUNC(PIO0_18_FUNC_ALT4)

                         /* Input polarity.
                          * : Disabled.
                          * Input function is not inverted. */
                         | IOCON_PIO_INVERT(PIO0_18_INVERT_DISABLED)

                         /* Select Digital mode.
                          * : Enable Digital mode.
                          * Digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO0_18_DIGIMODE_DIGITAL));
    }
    else
    {
        IOCON->PIO[0][18] = ((IOCON->PIO[0][18] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_INVERT_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT018 (pin 56) is configured as SCT0_OUT1. */
                         | IOCON_PIO_FUNC(PIO0_18_FUNC_ALT4)

                         /* Input polarity.
                          * : Disabled.
                          * Input function is not inverted. */
                         | IOCON_PIO_INVERT(PIO0_18_INVERT_DISABLED)

                         /* Select Digital mode.
                          * : Enable Digital mode.
                          * Digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO0_18_DIGIMODE_DIGITAL));
    }

    IOCON->PIO[0][26] = ((IOCON->PIO[0][26] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_INVERT_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT026 (pin 60) is configured as SCT0_OUT5. */
                         | IOCON_PIO_FUNC(PIO0_26_FUNC_ALT4)

                         /* Input polarity.
                          * : Disabled.
                          * Input function is not inverted. */
                         | IOCON_PIO_INVERT(PIO0_26_INVERT_DISABLED)

                         /* Select Digital mode.
                          * : Enable Digital mode.
                          * Digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO0_26_DIGIMODE_DIGITAL));

    IOCON->PIO[1][10] = ((IOCON->PIO[1][10] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_INVERT_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT110 (pin 40) is configured as SCT0_OUT3. */
                         | IOCON_PIO_FUNC(PIO1_10_FUNC_ALT4)

                         /* Input polarity.
                          * : Disabled.
                          * Input function is not inverted. */
                         | IOCON_PIO_INVERT(PIO1_10_INVERT_DISABLED)

                         /* Select Digital mode.
                          * : Enable Digital mode.
                          * Digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO1_10_DIGIMODE_DIGITAL));

    IOCON->PIO[1][17] = ((IOCON->PIO[1][17] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_INVERT_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT117 (pin 43) is configured as SCT0_OUT4. */
                         | IOCON_PIO_FUNC(PIO1_17_FUNC_ALT4)

                         /* Input polarity.
                          * : Disabled.
                          * Input function is not inverted. */
                         | IOCON_PIO_INVERT(PIO1_17_INVERT_DISABLED)

                         /* Select Digital mode.
                          * : Enable Digital mode.
                          * Digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO1_17_DIGIMODE_DIGITAL));

    IOCON->PIO[1][25] = ((IOCON->PIO[1][25] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_INVERT_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT125 (pin 77) is configured as SCT0_OUT2. */
                         | IOCON_PIO_FUNC(PIO1_25_FUNC_ALT2)

                         /* Input polarity.
                          * : Disabled.
                          * Input function is not inverted. */
                         | IOCON_PIO_INVERT(PIO1_25_INVERT_DISABLED)

                         /* Select Digital mode.
                          * : Enable Digital mode.
                          * Digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO1_25_DIGIMODE_DIGITAL));

    IOCON->PIO[1][4] = ((IOCON->PIO[1][4] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_INVERT_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT14 (pin 1) is configured as SCT0_OUT0. */
                        | IOCON_PIO_FUNC(PIO1_4_FUNC_ALT4)

                        /* Input polarity.
                         * : Disabled.
                         * Input function is not inverted. */
                        | IOCON_PIO_INVERT(PIO1_4_INVERT_DISABLED)

                        /* Select Digital mode.
                         * : Enable Digital mode.
                         * Digital input is enabled. */
                        | IOCON_PIO_DIGIMODE(PIO1_4_DIGIMODE_DIGITAL));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOART_InitTestPoint:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '93', peripheral: GPIO, signal: 'PIO1, 11', pin_signal: PIO1_11/FC1_TXD_SCL_MISO_WS/CT_INP5/USB0_VBUS, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

